---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.CreateCoreGeometryFailed
source: html/029f4cf1-6c95-745a-7ff9-ed65b20ef35c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.CreateCoreGeometryFailed Property

Failed to create core geometries.

## Syntax (C#)
```csharp
public static FailureDefinitionId CreateCoreGeometryFailed { get; }
```